In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],
                  [np.nan, np.nan, np.nan, 5]],
                  columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [21]:
df.dropna(axis=1, how='all')

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [22]:
df.dropna(axis=1, how='any')

   D
0  0
1  1
2  5

In [27]:
df.dropna(axis=0, how='all')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [33]:
df.fillna?

In [30]:
df.fillna({'A': 0, 'B': 1, 'C' : 2, 'D' : 3})

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [35]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values, limit=2)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  NaN  5

In [43]:
fill_na_value = df['B'].max()
fill_na_value

4.0

In [45]:
df.fillna(fill_na_value)

     A    B    C  D
0  4.0  2.0  4.0  0
1  3.0  4.0  4.0  1
2  4.0  4.0  4.0  5

In [47]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

In [48]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64